ninety-nine-cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birth_date", "2023-01-01"], ["color", "grey"], ["name", "kitty"], ["sex", "M"], ["description", "wut"], ["created_at", "2023-01-14 00:12:08.032341"], ["updated_at", "2023-01-14 00:12:08.032341"]]

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "black"], ["description", "lol"], ["updated_at", "2023-01-14 00:36:14.373858"], ["id", 1]]